7767517
89 104
Input                    input                    0 1 input
Convolution              Conv_0                   1 1 input 329 0=32 1=3 3=2 4=1 5=1 6=864 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_2                   1 1 329 332 0=32 1=3 4=1 5=1 6=288 7=32 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_4                   1 1 332 503 0=16 1=1 5=1 6=512
Convolution              Conv_5                   1 1 503 337 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_7                   1 1 337 340 0=96 1=3 3=2 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_9                   1 1 340 512 0=24 1=1 5=1 6=2304
Split                    splitncnn_0              1 2 512 512_splitncnn_0 512_splitncnn_1
Convolution              Conv_10                  1 1 512_splitncnn_1 345 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_12                  1 1 345 348 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_14                  1 1 348 521 0=24 1=1 5=1 6=3456
BinaryOp                 Add_15                   2 1 512_splitncnn_0 521 351
Convolution              Conv_16                  1 1 351 354 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_18                  1 1 354 357 0=144 1=3 3=2 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_20                  1 1 357 530 0=32 1=1 5=1 6=4608
Split                    splitncnn_1              1 2 530 530_splitncnn_0 530_splitncnn_1
Convolution              Conv_21                  1 1 530_splitncnn_1 362 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_23                  1 1 362 365 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_25                  1 1 365 539 0=32 1=1 5=1 6=6144
BinaryOp                 Add_26                   2 1 530_splitncnn_0 539 368
Split                    splitncnn_2              1 2 368 368_splitncnn_0 368_splitncnn_1
Convolution              Conv_27                  1 1 368_splitncnn_1 371 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_29                  1 1 371 374 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_31                  1 1 374 548 0=32 1=1 5=1 6=6144
BinaryOp                 Add_32                   2 1 368_splitncnn_0 548 377
Convolution              Conv_33                  1 1 377 380 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_35                  1 1 380 383 0=192 1=3 3=2 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_37                  1 1 383 557 0=64 1=1 5=1 6=12288
Split                    splitncnn_3              1 2 557 557_splitncnn_0 557_splitncnn_1
Convolution              Conv_38                  1 1 557_splitncnn_1 388 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_40                  1 1 388 391 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_42                  1 1 391 566 0=64 1=1 5=1 6=24576
BinaryOp                 Add_43                   2 1 557_splitncnn_0 566 394
Split                    splitncnn_4              1 2 394 394_splitncnn_0 394_splitncnn_1
Convolution              Conv_44                  1 1 394_splitncnn_1 397 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_46                  1 1 397 400 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_48                  1 1 400 575 0=64 1=1 5=1 6=24576
BinaryOp                 Add_49                   2 1 394_splitncnn_0 575 403
Split                    splitncnn_5              1 2 403 403_splitncnn_0 403_splitncnn_1
Convolution              Conv_50                  1 1 403_splitncnn_1 406 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_52                  1 1 406 409 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_54                  1 1 409 584 0=64 1=1 5=1 6=24576
BinaryOp                 Add_55                   2 1 403_splitncnn_0 584 412
Convolution              Conv_56                  1 1 412 415 0=384 1=1 5=1 6=24576 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_58                  1 1 415 418 0=384 1=3 4=1 5=1 6=3456 7=384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_60                  1 1 418 593 0=96 1=1 5=1 6=36864
Split                    splitncnn_6              1 2 593 593_splitncnn_0 593_splitncnn_1
Convolution              Conv_61                  1 1 593_splitncnn_1 423 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_63                  1 1 423 426 0=576 1=3 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_65                  1 1 426 602 0=96 1=1 5=1 6=55296
BinaryOp                 Add_66                   2 1 593_splitncnn_0 602 429
Split                    splitncnn_7              1 2 429 429_splitncnn_0 429_splitncnn_1
Convolution              Conv_67                  1 1 429_splitncnn_1 432 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_69                  1 1 432 435 0=576 1=3 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_71                  1 1 435 611 0=96 1=1 5=1 6=55296
BinaryOp                 Add_72                   2 1 429_splitncnn_0 611 438
Split                    splitncnn_8              1 2 438 438_splitncnn_0 438_splitncnn_1
Convolution              Conv_73                  1 1 438_splitncnn_1 441 0=576 1=1 5=1 6=55296 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_75                  1 1 441 444 0=576 1=3 3=2 4=1 5=1 6=5184 7=576 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_77                  1 1 444 620 0=160 1=1 5=1 6=92160
Split                    splitncnn_9              1 2 620 620_splitncnn_0 620_splitncnn_1
Convolution              Conv_78                  1 1 620_splitncnn_1 449 0=960 1=1 5=1 6=153600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_80                  1 1 449 452 0=960 1=3 4=1 5=1 6=8640 7=960 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_82                  1 1 452 629 0=160 1=1 5=1 6=153600
BinaryOp                 Add_83                   2 1 620_splitncnn_0 629 455
Split                    splitncnn_10             1 2 455 455_splitncnn_0 455_splitncnn_1
Convolution              Conv_84                  1 1 455_splitncnn_1 458 0=960 1=1 5=1 6=153600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_86                  1 1 458 461 0=960 1=3 4=1 5=1 6=8640 7=960 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_88                  1 1 461 638 0=160 1=1 5=1 6=153600
BinaryOp                 Add_89                   2 1 455_splitncnn_0 638 464
Convolution              Conv_90                  1 1 464 467 0=960 1=1 5=1 6=153600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_92                  1 1 467 470 0=960 1=3 4=1 5=1 6=8640 7=960 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_94                  1 1 470 647 0=320 1=1 5=1 6=307200
Split                    splitncnn_11             1 2 647 647_splitncnn_0 647_splitncnn_1
Convolution              Conv_95                  1 1 438_splitncnn_0 474 0=245 1=1 5=1 6=23520 9=1
Convolution              Conv_97                  1 1 647_splitncnn_1 476 0=245 1=1 5=1 6=78400 9=1
Interp                   Upsample_99              1 1 476 480 0=1 1=2.000000e+00 2=2.000000e+00
Pooling                  GlobalAveragePool_100    1 1 647_splitncnn_0 481 0=1 4=1
InnerProduct             Conv_101                 1 1 481 483 0=245 1=1 2=78400 9=1
BinaryOp                 Add_103                  2 1 474 480 484
BinaryOp                 Add_104                  2 1 484 483 485
Split                    splitncnn_12             1 2 485 485_splitncnn_0 485_splitncnn_1
ConvolutionDepthWise     Conv_105                 1 1 485_splitncnn_1 487 0=245 1=5 4=2 5=1 6=6125 7=245 9=1
Convolution              Conv_107                 1 1 487 489 0=256 1=1 5=1 6=62720 9=1
Split                    splitncnn_13             1 3 489 489_splitncnn_0 489_splitncnn_1 489_splitncnn_2
Convolution              Conv_109                 1 1 489_splitncnn_2 492 0=245 1=1 5=1 6=62720 9=4
BinaryOp                 Mul_111                  2 1 485_splitncnn_0 492 x 0=2
Convolution              Conv_112                 1 1 489_splitncnn_1 rpn_cls_score 0=25 1=1 5=1 6=6400 9=4
Convolution              Conv_113                 1 1 489_splitncnn_0 rpn_bbox_pred 0=100 1=1 5=1 6=25600
